[
  {
    "Priority": 0.0,
    "Graph": {
      "IsDirected": true,
      "Vertices": [
        {
          "Text": "Welcome, friend -- I saw you come in - nasty bump on the head you've got there. Something I can do for you?",
          "Id": 0
        },
        {
          "Text": "I do, we locked the door to the cellar once the rats started swarming around down there. Did you need it for something?",
          "Id": 1
        },
        {
          "Text": "Aye, I did. I'm sure there are other things lying around down there; the Elfsong's sheltered many thieves and cutthroats over the years. That's probably why there's that gate to the sewers down there. There's bound to be plenty of boltholes in the cellar and the sewers. I found the beholder in one of them, in a secret door behind some barrels in the far corner of the cellar.",
          "Id": 2
        },
        {
          "Text": "",
          "Id": 3
        },
        {
          "Text": "For your sake, I hope you're not planning to go after those thieves that attacked you?",
          "Id": 4
        },
        {
          "Text": "I overheard your conversation with Alyth - look, friend, you've met them once and escaped with your life; don't test your luck twice.",
          "Id": 5
        },
        {
          "Text": "Well, if the thieves won't keep you from going down there, then maybe the rats will.",
          "Id": 6
        },
        {
          "Text": "The smallest one's the length of my arm. HUGE rats, and they're swarming all over the place down there. Vicious little monsters; each one could kill a man, easy.",
          "Id": 7
        },
        {
          "Text": "They showed up about a week ago; if those thieves that attacked you are using the sewers to move around, then they probably drove the rats out of the sewers.",
          "Id": 8
        },
        {
          "Text": "All right, then; I won't say I didn't warn you. Here's the key to the cellar door - don't be too long, or else I'll have to come down and get you. Oh, and before you go, take this dagger - it's not much, but it might do you some good.",
          "GameEventTrigger": {
            "$type": "Temple.Infrastructure.Dialogues.GameEventTriggers.FactEstablishedEventTrigger",
            "FactId": "got_key_to_cellar_door_from_ethon"
          },
          "Id": 9
        },
        {
          "Text": "The gate to the sewers? What do you want to get to that rusty thing for? It's been sealed for years.",
          "Id": 10
        },
        {
          "Text": "Are you sure it was the rat problem or are you thinking of hunting down those thieves that attacked you?",
          "Id": 11
        },
        {
          "Text": "Friend, if I were you, I'd leave well enough alone. They let you live - once - no sense in tryingyour luck twice. Let them go.",
          "Id": 12
        }
      ],
      "Edges": [
        {
          "Text": "Alyth, the bartender, said you had the key to the cellar.",
          "VertexId1": 0,
          "VertexId2": 1,
          "KnowledgeRequired": "ethon_has_key_to_cellar"
        },
        {
          "Text": "I hear you're the one that found that stuffed beholder.",
          "VertexId1": 0,
          "VertexId2": 2,
          "KnowledgeRequired": "ethon_found_beholder"
        },
        {
          "Text": "Nothing. Sorry to disturb you.",
          "VertexId1": 0,
          "VertexId2": 3
        },
        {
          "Text": "I'll keep an eye out for them. Farewell, Ethon.",
          "VertexId1": 2,
          "VertexId2": 3
        },
        {
          "Text": "Alyth asked me to take care of this tavern's rat problem. I need to get into the cellar.",
          "VertexId1": 1,
          "VertexId2": 11
        },
        {
          "Text": "I need to get to the sewer gate down in the cellar, but I need your key first.",
          "VertexId1": 1,
          "VertexId2": 10
        },
        {
          "Text": "None of your business. Give me the key, old man.",
          "VertexId1": 1,
          "VertexId2": 4
        },
        {
          "Text": "What do you know about that?",
          "VertexId1": 4,
          "VertexId2": 5
        },
        {
          "Text": "I have to find them. They stole every last coin from me, and I aim to get what they stole back.",
          "VertexId1": 5,
          "VertexId2": 6
        },
        {
          "Text": "Rats don't concern me. Just give me the key.",
          "VertexId1": 6,
          "VertexId2": 9
        },
        {
          "Text": "What about the rats?",
          "VertexId1": 6,
          "VertexId2": 7
        },
        {
          "Text": "Where did the rats come from?",
          "VertexId1": 7,
          "VertexId2": 8
        },
        {
          "Text": "I'm still heading down there.",
          "VertexId1": 7,
          "VertexId2": 9
        },
        {
          "Text": "Then I'll have to be extra careful, then.",
          "VertexId1": 7,
          "VertexId2": 9
        },
        {
          "Text": "Whatever the dangers, I'm still heading down there.",
          "VertexId1": 8,
          "VertexId2": 9
        },
        {
          "Text": "Then I'll have to be extra careful, then.",
          "VertexId1": 8,
          "VertexId2": 9
        },
        {
          "Text": "Before I go, Alyth told me you were the one that found that stuffed beholder over the fireplace.",
          "VertexId1": 9,
          "VertexId2": 2,
          "KnowledgeRequired": "ethon_found_beholder"
        },
        {
          "Text": "I'll be careful. Thanks for the key.",
          "VertexId1": 9,
          "VertexId2": 3
        },
        {
          "Text": "What do you know about that?",
          "VertexId1": 11,
          "VertexId2": 5
        },
        {
          "Text": "My business is my own. I need the key to the cellar.",
          "VertexId1": 10,
          "VertexId2": 4
        },
        {
          "Text": "I was robbed on the streets by a number of thieves who may be using the sewers to move through Baldur's Gate. I aim to track them down.",
          "VertexId1": 10,
          "VertexId2": 12
        },
        {
          "Text": "I can't; they stole every last coin from me, and I aim to get what they stole back.",
          "VertexId1": 12,
          "VertexId2": 6
        }
      ]
    }
  },
  {
    "Priority": 10.0,
    "Condition": {
      "$type": "Temple.Infrastructure.GameConditions.FactEstablishedCondition",
      "FactId": "got_key_to_cellar_door_from_ethon"
    },
    "Graph": {
      "IsDirected": true,
      "Vertices": [
        {
          "Text": "Take care of those rats yet?",
          "Id": 0
        },
        {
          "Text": "",
          "Id": 1
        },
        {
          "Text": "Well, I keep my ear to the cobbles, friend, and that new guild that's come to Baldur's Gate is a terror. They're butchers, not thieves. They've killed some of the city watch, and they're said to have left their mark on the bodies. What kind of thieves kill the law and don't even take care to cover their hand in it? Fools, all of them... or powerful fools.",
          "Id": 2
        },
        {
          "Text": "That's the other thing. They just came out of the shadows a few weeks ago, and no one can place their faces. Not a one of them is local talent. They have a different way of doing things, and it usually involves a dagger between your ribs rather than lifting your purse. They're killers, not thives.",
          "Id": 3
        },
        {
          "Text": "Aye, I did. I'm sure there are other things lying around down there; the Elfsong's sheltered many thieves and cutthroats over the years. That's probably why there's that gate to the sewers down there. There's bound to be plenty of boltholes in the cellar and the sewers. I found the beholder in one of them, in a secret door behind some barrels in the far corner of the cellar.",
          "Id": 4
        }
      ],
      "Edges": [
        {
          "VertexId1": 0,
          "VertexId2": 1,
          "Text": "I'm still working on it."
        },
        {
          "VertexId1": 0,
          "VertexId2": 4,
          "Text": "Not all of them - I wanted to ask you about that stuffed beholder over the fireplace. Alyth told me you found it in the cellar.",
          "KnowledgeRequired": "ethon_found_beholder"
        },
        {
          "VertexId1": 0,
          "VertexId2": 2,
          "Text": "Not yet. Can you tell me anything about this new thieves guild?"
        },
        {
          "VertexId1": 2,
          "VertexId2": 3,
          "Text": "Do you know where this new guild came from?"
        },
        {
          "VertexId1": 2,
          "VertexId2": 1,
          "Text": "I'll be careful. Farewell, Ethon."
        },
        {
          "VertexId1": 4,
          "VertexId2": 1,
          "Text": "I'll keep an eye out for them. Farewell, Ethon."
        },
        {
          "VertexId1": 3,
          "VertexId2": 1,
          "Text": "I'll be careful. Thanks for the information, Ethon."
        }
      ]
    }
  },
  {
    "Priority": 20.0,
    "Condition": {
      "$type": "Temple.Infrastructure.GameConditions.BattleWonCondition",
      "BattleId": "bugbear_chieftain"
    },
    "Graph": {
      "IsDirected": true,
      "Vertices": [
        {
          "Text": "Thank the Gods you're here! Any longer and I'd be sitting in some kobold's belly",
          "Id": 0
        },
        {
          "Text": "Well, after I gave you the cellar door key, I felt guilty about letting you head down here without help, so I followed you down. No sooner do I get down here, then I'm surrounded by those yapping kobold devils, and they haul me to this cell and lock me in.",
          "Id": 1
        },
        {
          "Text": "There's an entrance to the sewers from the streets, and I used that... I knew about it from my days when I was in the guild. The *old* guild, not the new one.",
          "Id": 2
        },
        {
          "Text": "Retired - that life's behind me. Still, I've kept a bit of what I've learned, and it might help you now.",
          "Id": 3
        },
        {
          "Text": "",
          "Id": 4
        },
        {
          "Text": "I managed to pick this key off the chieftain you killed; I think it unlocks a gate deeper in the sewers. If you're still aiming to catch those thieves that robbed you, then you'll need it. While I was locked up here, I overheard some of the thieves from this new guild planning a mission. ...and that's what i heard. I don't know what that thief was carrying, but it can't have been good. If you want to stop whatever deviltry they've got planned, then you'll need to head deeper into the sewers and find that thief.",
          "Id": 5
        },
        {
          "Text": "All right, then - I don't need to tell you to be careful. I'll meet up with you at the Elfsong Tavern later on - come find me when you've found that thief and what he was carring. I'll try to dig up some of my old contacts and see if they can tell me anything about these thieves that could help you out.",
          "GameEventTrigger": {
            "$type": "Temple.Infrastructure.Dialogues.GameEventTriggers.FactEstablishedEventTrigger",
            "FactId": "got_key_to_sewer_level_2_from_ethon"
          },
          "Id": 6
        }
      ],
      "Edges": [
        {
          "VertexId1": 0,
          "VertexId2": 1,
          "Text": "Alyth told me you'd followed me down into the cellars, Ethon - I'm glad I found you."
        },
        {
          "VertexId1": 1,
          "VertexId2": 2,
          "Text": "But the door to the sewers was locked. How did you get down here?"
        },
        {
          "VertexId1": 2,
          "VertexId2": 3,
          "Text": "You're a thief?"
        },
        {
          "VertexId1": 2,
          "VertexId2": 4,
          "Text": "There was another entrance? So I didn't *need* to go through the sewers at all?"
        },
        {
          "VertexId1": 3,
          "VertexId2": 5,
          "Text": "What do you mean?"
        },
        {
          "VertexId1": 5,
          "VertexId2": 6,
          "Text": "I'll find him. Give me the key, and I'll head deeper into the sewers."
        },
        {
          "VertexId1": 5,
          "VertexId2": 6,
          "Text": "All right. Farewell, Ethon."
        }
      ]
    }
  },
  {
    "Priority": 30.0,
    "Condition": {
      "$type": "Temple.Infrastructure.GameConditions.FactEstablishedCondition",
      "FactId": "got_key_to_sewer_level_2_from_ethon"
    },
    "Graph": {
      "IsDirected": true,
      "Vertices": [
        {
          "Text": "Thanks for the rescue down in the sewers, friend. I feel like a right fool for not heeding my own advice and staying clear of the place. Here are a few coins as a way of thanks... and an old trinket of mine from my younger days; it's not much, but it may be of use to you.'",
          "GameEventTrigger": {
            "$type": "Temple.Infrastructure.Dialogues.GameEventTriggers.FactEstablishedEventTrigger",
            "FactId": "got_amulet_from_ethon"
          },
          "Id": 0
        },
        {
          "Text": "Did you find that thief who was running around in the sewers?",
          "Id": 1
        },
        {
          "Text": "",
          "Id": 2
        }
      ],
      "Edges": [
        {
          "VertexId1": 0,
          "VertexId2": 1,
          "Text": "Thanks, Ethon"
        },
        {
          "VertexId1": 1,
          "VertexId2": 2,
          "Text": "Not yet. I'm still looking. I'll return when I've found him"
        }
      ]
    }
  },
  {
    "Priority": 40.0,
    "Condition": {
      "$type": "Temple.Infrastructure.GameConditions.FactEstablishedCondition",
      "FactId": "got_amulet_from_ethon"
    },
    "Graph": {
      "IsDirected": true,
      "Vertices": [
        {
          "Text": "Nice weather, huh?",
          "Id": 0
        },
        {
          "Text": "",
          "Id": 1
        }
      ],
      "Edges": [
        {
          "VertexId1": 0,
          "VertexId2": 1,
          "Text": "Yeah, very nice indeed. Farewell"
        }
      ]
    }
  }
]
