[
  {
    "Priority": 100.0,
    "Conditions": [
      {
        "QuestId": "rat_infestation",
        "RequiredStatus": {
          "QuestState": 2,
          "AreCompletionCriteriaSatisfied": false
        }
      }
    ],
    "Graph": {
      "IsDirected": true,
      "Vertices": [
        {
          "Text": "Welcome, friend -- I saw you come in - nasty bump on the head you've got there. Something I can do for you?",
          "Id": 0
        },
        {
          "Text": "I do, we locked the door to the cellar once the rats started swarming around down there. Did you need it for something?",
          "Id": 1
        },
        {
          "Text": "Aye, I did. I'm sure there are other things lying around down there; the Elfsong's sheltered many thieves and cutthroats over the years. That's probably why there's that gate to the sewers down there. There's bound to be plenty of boltholes in the cellar and the sewers. I found the beholder in one of them, in a secret door behind some barrels in the far corner of the cellar.",
          "Id": 2
        },
        {
          "Text": "",
          "Id": 3
        },
        {
          "Text": "For your sake, I hope you're not planning to go after those thieves that attacked you?",
          "Id": 4
        },
        {
          "Text": "I overheard your conversation with Alyth - look, friend, you've met them once and escaped with your life; don't test your luck twice.",
          "Id": 5
        },
        {
          "Text": "Well, if the thieves won't keep you from going down there, then maybe the rats will.",
          "Id": 6
        },
        {
          "Text": "The smallest one's the length of my arm. HUGE rats, and they're swarming all over the place down there. Vicious little monsters; each one could kill a man, easy.",
          "Id": 7
        },
        {
          "Text": "They showed up about a week ago; if those thieves that attacked you are using the sewers to move around, then they probably drove the rats out of the sewers.",
          "Id": 8
        },
        {
          "Text": "All right, then; I won't say I didn't warn you. Here's the key to the cellar door - don't be too long, or else I'll have to come down and get you. Oh, and before you go, take this dagger - it's not much, but it might do you some good.",
          "Id": 9
        }
      ],
      "Edges": [
        {
          "Text": "Alyth, the bartender, said you had the key to the cellar.",
          "VertexId1": 0,
          "VertexId2": 1
        },
        {
          "Text": "I hear you're the one that found that stuffed beholder.",
          "VertexId1": 0,
          "VertexId2": 2
        },
        {
          "Text": "Nothing. Sorry to disturb you.",
          "VertexId1": 0,
          "VertexId2": 3
        },
        {
          "Text": "I'll keep an eye out for them. Farewell, Ethon.",
          "VertexId1": 2,
          "VertexId2": 3
        },
        {
          "Text": "Alyth asked me to take care of this tavern's rat problem. I need to get into the cellar.",
          "VertexId1": 1,
          "VertexId2": 3
        },
        {
          "Text": "I need to get to the sewer gate down in the cellar, but I need your key first.",
          "VertexId1": 1,
          "VertexId2": 3
        },
        {
          "Text": "None of your business. Give me the key, old man.",
          "VertexId1": 1,
          "VertexId2": 4
        },
        {
          "Text": "What do you know about that?",
          "VertexId1": 4,
          "VertexId2": 5
        },
        {
          "Text": "I have to find them. They stole every last coin from me, and I aim to get what they stole back.",
          "VertexId1": 5,
          "VertexId2": 6
        },
        {
          "Text": "Rats don't concern me. Just give me the key.",
          "VertexId1": 6,
          "VertexId2": 3
        },
        {
          "Text": "What about the rats?",
          "VertexId1": 6,
          "VertexId2": 7
        },
        {
          "Text": "Where did the rats come from?",
          "VertexId1": 7,
          "VertexId2": 8
        },
        {
          "Text": "I'm still heading down there.",
          "VertexId1": 7,
          "VertexId2": 3
        },
        {
          "Text": "Then I'll have to be extra careful, then.",
          "VertexId1": 7,
          "VertexId2": 3
        },
        {
          "Text": "Whatever the dangers, I'm still heading down there.",
          "VertexId1": 8,
          "VertexId2": 9
        },
        {
          "Text": "Before I go, Alyth told me you were the one that found that stuffed beholder over the fireplace.",
          "VertexId1": 9,
          "VertexId2": 2
        },
        {
          "Text": "I'll be careful. Thanks for the key.",
          "VertexId1": 9,
          "VertexId2": 3
        }
      ]
    }
  },
  {
    "Priority": 0.0,
    "Graph": {
      "IsDirected": true,
      "Vertices": [
        {
          "Text": "Do you like my brown sweater, huh?",
          "Id": 0
        },
        {
          "Text": "",
          "Id": 1
        }
      ],
      "Edges": [
        {
          "Text": "Sure, Ethon",
          "VertexId1": 0,
          "VertexId2": 1
        }
      ]
    }
  }
]
